vednildip/ESP32-webcam-control-Mirroring-ESP-NOW-/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include "board_config.h"
#include <esp_now.h>
#include <WiFi.h>
#include <stdint.h>
#define LED_BUILTIN 33
#define CHUNK_LENGTH 246
#define WIFI_SSID "vivo_office"
const uint8_t receiver_mac[] = { 0x24, 0x58, 0x7C, 0xD3, 0x5F, 0x9C };
bool espNowInitialized = false;
bool connected = false;
volatile bool ack_received = false;
//volatile bool sending = false;
volatile bool sendingEspNow = false;
volatile bool sendingWeb    = false;
volatile bool streamActive = false;
extern bool espnowActive;
unsigned long espnowStartTime = 0;
// --- ESP-NOW Send Callback ---
void onDataSent(const wifi_tx_info_t* tx_info, esp_now_send_status_t status) {
  // Access MAC address

  Serial.println(status == ESP_NOW_SEND_SUCCESS ? "Delivery Success" : "Delivery Fail");
    
  if (status == ESP_NOW_SEND_SUCCESS) {
    ack_received = true;
    digitalWrite(LED_BUILTIN, LOW);
  }
  sendingEspNow = false;   // ⭐ REQUIRED
}
// --- Chunked Data Sender ---
void sendPacketData(const char* buf, uint16_t len, uint16_t chunkLength) {
  uint8_t buffer[chunkLength];
  size_t fullChunks = len / chunkLength;
  size_t remainder = len % chunkLength;

  Serial.println("📤 Starting packet transmission");

  for (size_t i = 0; i < fullChunks; ++i) {
    memcpy(buffer, buf + (i * chunkLength), chunkLength);
    ack_received = false;

    if (esp_now_send(receiver_mac, buffer, chunkLength) != ESP_OK) {
      Serial.println("❌ Send failed");
      break;
    }

    unsigned long start = millis();
    while (!ack_received && millis() - start < 1000) delay(1);

    if (!ack_received) {
      Serial.println("⚠️ No ACK received, stopping");
      break;
    }
  }

  if (remainder) {
    memcpy(buffer, buf + (len - remainder), remainder);
    ack_received = false;

    if (esp_now_send(receiver_mac, buffer, remainder) == ESP_OK) {
      unsigned long start = millis();
      while (!ack_received && millis() - start < 1000) delay(1);
    }
  }

  Serial.println("✅ Transmission complete");
  //sending = false;
}

void captureAndSendFrame() {
  if (!connected || sendingEspNow || sendingWeb) return;

  //sending = true;
    sendingEspNow = true;

  camera_fb_t* fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("❌ Camera capture failed");
    //sending = false;
    sendingEspNow = false;
    return;
  }

  if (fb->format == PIXFORMAT_JPEG) {
    sendPacketData((const char*)fb->buf, fb->len, CHUNK_LENGTH);
  } else {
    Serial.println("⚠️ Non-JPEG format not supported");
  }

  esp_camera_fb_return(fb);
  //sending = false;
  sendingEspNow = false;
}

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size) {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if defined(LED_GPIO_NUM)
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_GPIO_NUM, duty);
  //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

static esp_err_t bmp_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();
#endif
  fb = esp_camera_fb_get();
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

